#include <stdio.h>
#include <stdlib.h>

void curie(int, char, char, char);

int main (int argc, char*argv[]) {

    int n;
    printf("------------------------------------------------------\n");
    printf("Δώσε αριθμό δίσκων: ");
    scanf("%d", &n);
    if (!(n>0)) {
        printf("Σφάλμα.\n");
        exit(0);
    }
    printf("------------------------------------------------------\n");
    printf("Έστω a η πρώτη στήλη, b η δεύτερη και c η τρίτη.\n");
    printf("Οι κινήσεις που πρέπει να γίνουν είναι: \n");
    printf("------------------------------------------------------\n");
    curie(n, 'a', 'c', 'b');
    printf("------------------------------------------------------\n");

    return 0;
}

void curie(int n, char a, char c, char b) {

   if (n==1) {
       printf("Μετακίνησε τον δίσκο %d από το %c στο %c\n", n, a, c);
       /* πρέπει να πάμε από το a στο c */
       return;
    }

    curie(n-1,a, b, c); /* πρέπει να πάμε από το a στο b με την βοήθεια του c */
    printf("Μετακίνησε τον δίσκο %d από το %c στο %c\n", n, a, c);
    curie(n-1,b, c, a); /* πρέπει να πάμε απο το b στο c με την βοήθεια του a */

    return;
}